app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
def index
@title = "All users"
@users = User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "encrypted_password", "salt", "admin") VALUES ('gaurav', 'gaurav.khande@gmail.com', '2011-03-27 16:04:24.199471', '2011-03-27 16:04:24.199471', '90ed20edcafe660704abae9412f8067a10bec502031042e65ea5212d0908f498', '2e772a500d65ac405d70799bf7502098d3ffe7125ea2209b8055877a1024e5d0', 'f')
---
def create
@user = User.new(params[:user])
if @user.save